# Missing Data

There are 3 ways to deal with missing data: 
1. Leave it as missing
2. Remove the missing data
3. Fill in the missing data

In [2]:
import numpy as np
import pandas as pd

In [6]:
df = pd.DataFrame({'A':[1,2,np.nan,4], 'B':[5,np.nan, np.nan,8], 'C':[10,20,30,40]})

In [7]:
df

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  NaN  NaN  30
3  4.0  8.0  40

In [16]:
#0.25(len(df))
df.dropna(axis=1, thresh=3)  #this removes the missing parameters, return back rows where nothing is missing, column is axis =1

     A   C
0  1.0  10
1  2.0  20
2  NaN  30
3  4.0  40

(axis= 0 or 1, thresh = int) represents how many non null values a column/ row must have

## Fill in the missing data

In [21]:
df.fillna(value='FILL VALUE')

            A           B   C
0         1.0         5.0  10
1         2.0  FILL VALUE  20
2  FILL VALUE  FILL VALUE  30
3         4.0         8.0  40

In [23]:
df.fillna(value=0)

     A    B   C
0  1.0  5.0  10
1  2.0  0.0  20
2  0.0  0.0  30
3  4.0  8.0  40

In [24]:
df

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  NaN  NaN  30
3  4.0  8.0  40

You can also do this across columns or rows

In [31]:
df.iloc[2]=df.iloc[2].fillna(value=0)#this is for rows

In [32]:
df['A']= df['A'].fillna(value=0)

In [33]:
df

     A    B   C
0  1.0  5.0  10
1  2.0  0.0  20
2  0.0  0.0  30
3  4.0  8.0  40

In [36]:
df['B'].fillna(value=df['B'].mean()) #finds the mean for column b #theres no NaN so there's nothing to change lel

0    5.0
1    0.0
2    0.0
3    8.0
Name: B, dtype: float64